# Group Exercise

In this activity, there all 12 questions prepared with varying levels of difficulty. Your task is to answer as many as you can AS A GROUP. Each question is independent of one another. Delegate and strategize on how you will answer the most number of questions. **Good luck! :)**

#### First, setup the data

In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [8]:
schools = pd.read_csv("schools_combined.csv")

/opt/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3058: DtypeWarning: Columns (10,11) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [9]:
schools.head()

,Unnamed: 0,region,province,municipality,division,school_id,school_name,year_level,gender,enrollment,latitude,longitude,ID,Total_Inst,Rooms_used,Rooms_unused,Type_of_Sc
0,0,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 1,male,41,18.25096389,120.6089583,100002,16,12.0,0.0,School with no Annexes
1,1,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 1,female,30,18.25096389,120.6089583,100002,16,12.0,0.0,School with no Annexes
2,2,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 2,male,37,18.25096389,120.6089583,100002,16,12.0,0.0,School with no Annexes
3,3,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 2,female,38,18.25096389,120.6089583,100002,16,12.0,0.0,School with no Annexes
4,4,Region I - Ilocos Region,Ilocos Norte,Bacarra,Ilocos Norte,100002,Bacarra CES,grade 3,male,41,18.25096389,120.6089583,100002,16,12.0,0.0,School with no Annexes

#### Before proceeding with the questions, check first with your groupmates if you all have the correct dataframe.

1. What is the size of the dataframe?

In [10]:
schools.shape

(159744, 17)

2. What are the columns?

In [11]:
schools.column

AttributeError: 'DataFrame' object has no attribute 'column'

3. How many schools are there?

In [12]:
schools.school_id.nunique()

14003

4. How many missing values are there?

In [13]:
schools.isna().sum()

Unnamed: 0       0
region           0
province         0
municipality     0
division         0
school_id        0
school_name      0
year_level       0
gender           0
enrollment       0
latitude         0
longitude        0
ID               0
Total_Inst       0
Rooms_used      12
Rooms_unused    12
Type_of_Sc       0
dtype: int64

Alright! Get started!

## Exercise

***Easy***

1. Which has a greater number of overall enrollees: males or females?

In [15]:
schools.groupby("gender")["enrollment"].sum()

gender
female    3870769
male      4053979
Name: enrollment, dtype: int64

2. How many municiapalities are covered by the dataframe?

In [78]:
schools["municipality"].nunique()

996

3. Which year_level has the highest number of enrollees?

In [44]:
schools.groupby("year_level")["enrollment"].sum()

year_level
first year     817414
fourth year    626902
grade 1        792898
grade 2        824246
grade 3        844424
grade 4        920665
grade 5        846376
grade 6        777489
second year    764328
third year     710006
Name: enrollment, dtype: int64

4. Are school_id equal to school_name? What is the discrepancy

In [114]:
schools["school_id"].nunique() - schools["school_name"].nunique()

1988

5. How many teachers are there overall?

In [125]:
schools.groupby("school_id")["Total_Inst"].min().sum()

179044

***Medium***

6. Which province has the highest count of schools? How many is it?

In [33]:
schools.groupby(["province"])["school_id"].nunique().sort_values(ascending=False)

province
Leyte                  1241
Pangasinan              834
North Cotabato          708
Negros Oriental         695
Zamboanga Del Sur       694
                       ...
Quirino                   1
Apayao                    1
Sulu                      1
Zamboanga Del Norte       1
Abra                      1
Name: school_id, Length: 81, dtype: int64

7. How many provinces only has one school? Which provinces are these?

In [42]:
schools.groupby(["province"])["school_id"].nunique().to_frame().sort_values(by="school_id").head(10)

                     school_id
province
Abra                         1
Zamboanga Del Norte          1
Sulu                         1
Apayao                       1
Quirino                      1
Mountain Province            1
Dinagat Islands              3
Siquijor                     4
Maguindanao                  4
Misamis Occidental           8

8. How many municipalities are there in ARMM?

In [71]:
schools[schools["region"]=="ARMM - Autonomous Region in Muslim Mindanao"]["municipality"].nunique()

23

9. Which school has the most number of rooms (used + unused)? - Medium

In [52]:
sub_rooms = schools.groupby("school_id")["Rooms_used", "Rooms_unused"].sum()
sub_rooms["Rooms_all"] = sub_rooms["Rooms_used"] + sub_rooms["Rooms_unused"]
sub_rooms.sort_values(by="Rooms_all")

           Rooms_used  Rooms_unused  Rooms_all
school_id
120590            0.0           0.0        0.0
130233            0.0           0.0        0.0
131871            0.0           0.0        0.0
128873            0.0           0.0        0.0
125289            0.0           0.0        0.0
...               ...           ...        ...
109396         1248.0           0.0     1248.0
109791         1236.0          48.0     1284.0
131240         1464.0           0.0     1464.0
127940         1476.0           0.0     1476.0
305413         1496.0           0.0     1496.0

[14003 rows x 3 columns]

10. Within the schools in Central Visayas, how many female enrollees do they have all in all?

In [69]:
schools[(schools["region"]=="Region VII - Central Visayas") & (schools["gender"]=="female")]["enrollment"].sum()

222644

In [61]:
schools["region"].value_counts()

Region VIII - Eastern Visayas                  22820
Region VI - Western Visayas                    16760
Region I - Ilocos Region                       16380
Region IV-A - CALABARZON                       13568
Region IX - Zamboanga Peninsula                13300
Region III - Central Luzon                     12564
Region V - Bicol Region                        12300
CARAGA - CARAGA                                11388
Region VII - Central Visayas                   10708
Region XII - SOCCSKSARGEN                       8124
Region XI - Davao Region                        6980
Region IV-B - MIMAROPA                          4668
Region II - Cagayan Valley                      4040
Region X - Northern Mindanao                    2204
NCR - National Capital Region                   1952
Region XII - Soccsksargen                       1256
CAR - Cordillera Administrative Region           368
ARMM - Autonomous Region in Muslim Mindanao      364
Name: region, dtype: int64

***Hard***

11. How many secondary students are there overall?

12. Which school_id has the highest teacher-student ratio?

In [15]:
schools.groupby("school_id")["enrollment","Total_Inst"].agg(students=("enrollment", sum), 
                                                            teacher=("Total_Inst", max))

           students  teacher
school_id
100002          407       16
100003          152        6
100004          107        7
100005           67        7
100007          137        7
...             ...      ...
321504          615       13
321601         2832       16
322502          143        6
322503          130        8
322601          318        8

[14003 rows x 2 columns]